<h4>陣列練習-學生成績資料設計</h4>
<hr>

<?php

$judy=["國文"=>95,"英文"=>64,"數學"=>70,"地理"=>90,"歷史"=>84];
$amo=["國文"=>88,"英文"=>78,"數學"=>54,"地理"=>87,"歷史"=>71];
$john=["國文"=>45,"英文"=>60,"數學"=>68,"地理"=>70,"歷史"=>62];
$peter=["國文"=>59,"英文"=>32,"數學"=>77,"地理"=>54,"歷史"=>42];
$hebe=["國文"=>71,"英文"=>62,"數學"=>80,"地理"=>62,"歷史"=>64];

echo "<pre>";print_r($judy);echo "</pre>";


$score=[
  "judy"=>[
    "國文"=>95,
    "英文"=>64,
    "數學"=>70,
    "地理"=>90,
    "歷史"=>84,
  ],
  "amo"=>[
    "國文"=>88,
    "英文"=>78,
    "數學"=>54,
    "地理"=>87,
    "歷史"=>71,
  ],
  "john"=>[
    "國文"=>45,
    "英文"=>60,
    "數學"=>68,
    "地理"=>70,
    "歷史"=>62,
  ],
  "peter"=>[
    "國文"=>59,
    "英文"=>32,
    "數學"=>77,
    "地理"=>54,
    "歷史"=>42,
  ],
  "hebe"=>[
    "國文"=>71,
    "英文"=>62,
    "數學"=>80,
    "地理"=>62,
    "歷史"=>64,
  ]
  
  ];

echo "<pre>";print_r($score);echo "</pre>";
echo "<hr>";

//定義變數
for($i=1;$i<=9;$i++){
  for($j=1;$j<=9;$j++){
    $a[]=$i . " x " . $j . " = " . ($i*$j);
  }
}
//使用foreach陣列方式
foreach($a as $key =>$d){

  echo $d . " , ";

  if($key%9==8){
    echo "<br>";
  }
}
echo "<hr>";
//使用for loop方式也可以
for($i=0;$i<count($a);$i++){

  echo $a[$i] . " , ";

  if($i%9==8){
    echo "<br>";
  }

}

?>