<h4>已知西元1024年為甲子年，提供一個西元年份，輸出天干地支的年別</h4>
<hr>

<?php

$sky=[ "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸" ];
$land=[ "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥" ];

$start=1024;
$year=2023;
$arr=[];

for($i=1024;$i<1084;$i++){
  // $arr[]=$i;
  $arr[$i]=$sky[($i-4)%10] . $land[($i-4)%12];
  // $arr[$i]=$sky[($i-4)%10] . $land[($i-4)%12]; 
  //因為一開始$i%10、$i%12的餘數是4，等於$sky[4]、$land[4]兩個陣列都從index=4的位置取元素出來。現在為了符合定義1024年為取"甲"、"子"，所以index都要是=0，才能取到甲、子。
  // 課堂是這樣寫法：$arr[$i]=$sky[($i%10+6)%10] . $land[($i%12+8)%12];

}

for($i=1024;$i<3000;$i++){

  $arr[$i]=$sky[($i-4)%10] . $land[($i-4)%12];

}

echo $year."是".$arr[$year]."年";

// echo "<pre>";print_r($arr);"</pre>";
?>
<hr>
<?php
// 方法二，直接改陣列內容元素的順序
$year=2023;
$sky=[ "庚", "辛", "壬", "癸", "甲", "乙", "丙", "丁", "戊", "己"];
$land=[ "申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "未"];
$arr=[];

for ($i=1024; $i <3000 ; $i++) { 
  $arr[$i]=$sky[$i%10].$land[$i%12];
}

echo $year."是".$arr[$year]."年";
echo "<pre>";print_r($arr);"</pre>";
?>